# Домашнее задание 1

Работа с Pandas: просмотр данных, объединение таблиц, анализ и свод данных.

## Описание данных

В папке Data находится информация о студентах. Всего 10 групп студентов.  
Файлы делятся на две категории:
*   Students_info_i - информация о студентах из группы i
*   Students_marks_i - оценки студентов из группы i за экзамены

Одно из важных достоинств pandas $-$ это удобные методы реляционного взаимодействия с данными, аналогичные, например, возможностям SQL для слияния и конкатенации таблиц: merge, join, concat. Наличие готовых методов позволяет не реализовывать самостоятельно поэлементную обработку данных и оперировать сразу целыми таблицами данных.

Подробно об этих методах посмотрите тут:

 https://www.kaggle.com/residentmario/renaming-and-combining#Combining

## Практика

In [ ]:
# импортируем библиотеку Pandas
import pandas as pd
# импортируем библиотеку os для понятных путей в винде
import os

In [ ]:
# # Разархивирование для Windows
# import zipfile
# import os

# # Путь к вашему ZIP-файлу
# zip_file_path = 'Data.zip'  
# # Директория, куда будут распакованы файлы
# output_directory = 'Data'  

# # Создание директории, если её не существует
# os.makedirs(output_directory, exist_ok=True)

# # Распаковка файла
# with zipfile.ZipFile(zip_file_path, 'r') as zip_ref:
#     zip_ref.extractall(output_directory)

# print(f'Файлы распакованы в директорию: {os.path.abspath(output_directory)}')

Файлы распакованы в директорию: C:\Users\LENOVO\YandexDisk\HSE_Lect\Машинное обучение\Лекция1+ДЗ1\Data

In [ ]:
import os

# Укажите путь к директории, которую хотите проверить
directory_path = 'Data'

# Получаем список файлов в директории
try:
    files = os.listdir(directory_path)
    print("Содержимое директории:")
    for file in files:
        print(file)  # Отображение имен файлов
except FileNotFoundError:
    print(f"Директория '{directory_path}' не найдена.")
except Exception as e:
    
    print(f"Произошла ошибка: {e}")

Содержимое директории:
Data
Students_info_0.csv
Students_info_1.csv
Students_info_2.csv
Students_info_3.csv
Students_info_4.csv
Students_info_5.csv
Students_info_6.csv
Students_info_7.csv
Students_info_8.csv
Students_info_9.csv
Students_marks_0.csv
Students_marks_1.csv
Students_marks_2.csv
Students_marks_3.csv
Students_marks_4.csv
Students_marks_5.csv
Students_marks_6.csv
Students_marks_7.csv
Students_marks_8.csv
Students_marks_9.csv

In [16]:
# # смотрим что получилось
# !ls -lah Data.zip

### Задание 1

Соберите всю информацию о студентах в одну таблицу df. В получившейся таблице должна быть информация и оценки всех студентов из всех групп. Напечатайте несколько строк таблицы для демонстрации результата

In [ ]:
# ваш код здесь
df1 = pd.read_csv("Data/Students_info_0.csv")
df1.head

<bound method NDFrame.head of     index  gender race/ethnicity parental level of education         lunch  \
0       0  female        group B           bachelor's degree      standard
1       1  female        group C                some college      standard
2       2  female        group B             master's degree      standard
3       3    male        group A          associate's degree  free/reduced
4       4    male        group C                some college      standard
..    ...     ...            ...                         ...           ...
95     95    male        group C          associate's degree  free/reduced
96     96    male        group B            some high school      standard
97     97  female        group E                some college      standard
98     98  female        group D                some college  free/reduced
99     99  female        group D           bachelor's degree      standard

   test preparation course   group
0                     none  group1
1                completed  group1
2                     none  group1
3                     none  group1
4                     none  group1
..                     ...     ...
95               completed  group1
96               completed  group1
97               completed  group1
98                    none  group1
99                    none  group1

[100 rows x 7 columns]>

In [22]:
df1 = pd.read_csv("Data/Students_marks_0.csv")
df1.head

<bound method NDFrame.head of     index  math score  reading score  writing score
0       0          72             72             74
1       1          69             90             88
2       2          90             95             93
3       3          47             57             44
4       4          76             78             75
..    ...         ...            ...            ...
95     95          78             81             82
96     96          65             66             62
97     97          63             72             70
98     98          58             67             62
99     99          65             67             62

[100 rows x 4 columns]>

In [26]:
import pandas as pd
import glob

# Получаем список Студентов, отсортированных по номеру
file_list = sorted(
    glob.glob('Data/Students_info_*.csv'), 
    key=lambda x: int(x.split('_')[-1].split('.')[0])
)

# Объединяем файлы с добавлением номера
dataframes = []
for file in file_list:
    file_number = int(file.split('_')[-1].split('.')[0])
    df = pd.read_csv(file)
    df['file_number'] = file_number
    dataframes.append(df)

combined_info_df = pd.concat(dataframes, ignore_index=True)
combined_info_df

,index,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,file_number
0,0,female,group B,bachelor's degree,standard,none,group1,0
1,1,female,group C,some college,standard,completed,group1,0
2,2,female,group B,master's degree,standard,none,group1,0
3,3,male,group A,associate's degree,free/reduced,none,group1,0
4,4,male,group C,some college,standard,none,group1,0
...,...,...,...,...,...,...,...,...
995,995,female,group E,master's degree,standard,completed,group10,9
996,996,male,group C,high school,free/reduced,none,group10,9
997,997,female,group C,high school,free/reduced,completed,group10,9
998,998,female,group D,some college,standard,completed,group10,9
999,999,female,group D,some college,free/reduced,none,group10,9

In [28]:
# Смотрим данные о таблице со студентами
# combined_info_df.head()
combined_info_df.describe()

             index  file_number
count  1000.000000  1000.000000
mean    499.500000     4.500000
std     288.819436     2.873719
min       0.000000     0.000000
25%     249.750000     2.000000
50%     499.500000     4.500000
75%     749.250000     7.000000
max     999.000000     9.000000

In [197]:
import pandas as pd
import glob

# Получаем список оценок, отсортированных по номеру
file_list = sorted(
    glob.glob('Data/Students_marks_*.csv'), 
    key=lambda x: int(x.split('_')[-1].split('.')[0])
)

# Объединяем файлы с добавлением номера
dataframes = []
for file in file_list:
    file_number = int(file.split('_')[-1].split('.')[0])
    df = pd.read_csv(file)
    df['file_number'] = file_number
    dataframes.append(df)

combined_marks_df = pd.concat(dataframes, ignore_index=True)
combined_marks_df

    index  math score  reading score  writing score  file_number
0       0          72             72             74            0
1       1          69             90             88            0
2       2          90             95             93            0
3       3          47             57             44            0
4       4          76             78             75            0
..    ...         ...            ...            ...          ...
95    995          88             99             95            9
96    996          62             55             55            9
97    997          59             71             65            9
98    998          68             78             77            9
99    999          77             86             86            9

[1000 rows x 5 columns]

In [199]:
# Смотрим данные о таблице с оценками
# combined_marks_df.head()
combined_marks_df.describe()

             index  math score  reading score  writing score  file_number
count  1000.000000  1000.00000    1000.000000    1000.000000  1000.000000
mean    499.500000    66.08900      69.169000      68.054000     4.500000
std     288.819436    15.16308      14.600192      15.195657     2.873719
min       0.000000     0.00000      17.000000      10.000000     0.000000
25%     249.750000    57.00000      59.000000      57.750000     2.000000
50%     499.500000    66.00000      70.000000      69.000000     4.500000
75%     749.250000    77.00000      79.000000      79.000000     7.000000
max     999.000000   100.00000     100.000000     100.000000     9.000000

In [34]:
# Объеденим таблицы по индексу в pandas
# Объединение по горизонтали (колонки)
df = pd.merge(combined_info_df, combined_marks_df, on='index')
df

,index,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,file_number_x,math score,reading score,writing score,file_number_y
0,0,female,group B,bachelor's degree,standard,none,group1,0,72,72,74,0
1,1,female,group C,some college,standard,completed,group1,0,69,90,88,0
2,2,female,group B,master's degree,standard,none,group1,0,90,95,93,0
3,3,male,group A,associate's degree,free/reduced,none,group1,0,47,57,44,0
4,4,male,group C,some college,standard,none,group1,0,76,78,75,0
...,...,...,...,...,...,...,...,...,...,...,...,...
995,995,female,group E,master's degree,standard,completed,group10,9,88,99,95,9
996,996,male,group C,high school,free/reduced,none,group10,9,62,55,55,9
997,997,female,group C,high school,free/reduced,completed,group10,9,59,71,65,9
998,998,female,group D,some college,standard,completed,group10,9,68,78,77,9
999,999,female,group D,some college,free/reduced,none,group10,9,77,86,86,9

In [36]:
# Смотрим данные о таблице
# df.head()
df.describe()

,index,file_number_x,math score,reading score,writing score,file_number_y
count,1000.000000,1000.000000,1000.00000,1000.000000,1000.000000,1000.000000
mean,499.500000,4.500000,66.08900,69.169000,68.054000,4.500000
std,288.819436,2.873719,15.16308,14.600192,15.195657,2.873719
min,0.000000,0.000000,0.00000,17.000000,10.000000,0.000000
25%,249.750000,2.000000,57.00000,59.000000,57.750000,2.000000
50%,499.500000,4.500000,66.00000,70.000000,69.000000,4.500000
75%,749.250000,7.000000,77.00000,79.000000,79.000000,7.000000
max,999.000000,9.000000,100.00000,100.000000,100.000000,9.000000

### Задание 2

Удалите столбец index у полученной таблицы. Напечатайте первые 10 строк таблицы

In [75]:
# ваш код здесь
# Удаляем колонку индекс
df.drop('index', axis = 1, inplace = True)
df

,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,file_number_x,math score,reading score,writing score,file_number_y
0,female,group B,bachelor's degree,standard,none,group1,0,72,72,74,0
1,female,group C,some college,standard,completed,group1,0,69,90,88,0
2,female,group B,master's degree,standard,none,group1,0,90,95,93,0
3,male,group A,associate's degree,free/reduced,none,group1,0,47,57,44,0
4,male,group C,some college,standard,none,group1,0,76,78,75,0
...,...,...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,group10,9,88,99,95,9
996,male,group C,high school,free/reduced,none,group10,9,62,55,55,9
997,female,group C,high school,free/reduced,completed,group10,9,59,71,65,9
998,female,group D,some college,standard,completed,group10,9,68,78,77,9
999,female,group D,some college,free/reduced,none,group10,9,77,86,86,9

### Задание 3

Выведите на экран размеры полученной таблицы

In [79]:
# ваш код здесь
df.shape

(1000, 11)

### Задание 4

Выведите на экран статистические характеристики числовых столбцов таблицы (минимум, максимум, среднее значение, стандартное отклонение)

In [81]:
# ваш код здесь
df.describe()

       file_number_x  math score  reading score  writing score  file_number_y
count    1000.000000  1000.00000    1000.000000    1000.000000    1000.000000
mean        4.500000    66.08900      69.169000      68.054000       4.500000
std         2.873719    15.16308      14.600192      15.195657       2.873719
min         0.000000     0.00000      17.000000      10.000000       0.000000
25%         2.000000    57.00000      59.000000      57.750000       2.000000
50%         4.500000    66.00000      70.000000      69.000000       4.500000
75%         7.000000    77.00000      79.000000      79.000000       7.000000
max         9.000000   100.00000     100.000000     100.000000       9.000000

### Задание 5

Проверьте, есть ли в таблице пропущенные значения

In [38]:
# ваш код здесь

df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 12 columns):
 #   Column                       Non-Null Count  Dtype
---  ------                       --------------  -----
 0   index                        1000 non-null   int64
 1   gender                       1000 non-null   object
 2   race/ethnicity               1000 non-null   object
 3   parental level of education  1000 non-null   object
 4   lunch                        1000 non-null   object
 5   test preparation course      1000 non-null   object
 6   group                        1000 non-null   object
 7   file_number_x                1000 non-null   int64
 8   math score                   1000 non-null   int64
 9   reading score                1000 non-null   int64
 10  writing score                1000 non-null   int64
 11  file_number_y                1000 non-null   int64
dtypes: int64(6), object(6)
memory usage: 93.9+ KB

In [96]:
df.dropna()

,gender,race/ethnicity,parental level of education,lunch,test preparation course,group,file_number_x,math score,reading score,writing score,file_number_y
0,female,group B,bachelor's degree,standard,none,group1,0,72,72,74,0
1,female,group C,some college,standard,completed,group1,0,69,90,88,0
2,female,group B,master's degree,standard,none,group1,0,90,95,93,0
3,male,group A,associate's degree,free/reduced,none,group1,0,47,57,44,0
4,male,group C,some college,standard,none,group1,0,76,78,75,0
...,...,...,...,...,...,...,...,...,...,...,...
995,female,group E,master's degree,standard,completed,group10,9,88,99,95,9
996,male,group C,high school,free/reduced,none,group10,9,62,55,55,9
997,female,group C,high school,free/reduced,completed,group10,9,59,71,65,9
998,female,group D,some college,standard,completed,group10,9,68,78,77,9
999,female,group D,some college,free/reduced,none,group10,9,77,86,86,9

### Задание 6

Выведите на экран средние баллы студентов по каждому предмету (`math`, `reading`, `writing`)

Здесь и далее, если вам мешают пропуски -- считайте средние и т. д. по тем студентам, у которых есть необходимые значения.

In [110]:
# ваш код здесь
mean_scores = df[['math score', 'reading score', 'writing score']].mean()
print(mean_scores)

math score       66.089
reading score    69.169
writing score    68.054
dtype: float64

### Задание 7

Как зависят оценки от того, проходил ли студент курс для подготовки к сдаче экзамена (test preparation course)?

Выведите на экран для каждого предмета в отдельности средний балл студентов, проходивших курс для подготовки к экзамену и не проходивших курс.

In [136]:
# ваш код здесь

dependence_scores = df.groupby('test preparation course')[['math score', 'reading score', 'writing score']].mean()

dependence_scores

                         math score  reading score  writing score
test preparation course
completed                 69.695531      73.893855      74.418994
none                      64.077882      66.534268      64.504673

### Задание 8

Выведите на экран все различные значения из столбца `lunch`

In [124]:
# ваш код здесь
unique_lunch =df['lunch'].unique()
print(unique_lunch)

['standard' 'free/reduced']

### Задание 9

Переименуйте колонку `parental level of education` в `education`, а `test preparation course` в `test preparation` с помощью метода pandas [`rename`](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.rename.html)

### Задание 10

**Зафиксируем минимальный балл для сдачи экзамена**

In [124]:
passmark = 50

**Ответьте на вопросы**
* Какая доля студентов сдала экзамен по математике (passmark > 50)?
* Какая доля студентов, проходивших курс подготовки к экзамену, сдала экзамен по математике?
* Какая доля женщин, не проходивших курс подготовки к экзамену, не сдала экзамен по математике?

In [127]:
# ваш код здесь

math_passed = (df['math score']> passmark).mean() 
print (f'{math_passed:.2%}')

85.00%

In [129]:
# ваш код здесь
passed_math_prep = (df[df['test preparation course'] == 'completed']['math score'] > passmark).mean()
print (f'{passed_math_prep:.2%}')

90.78%

In [131]:
# ваш код здесь
falied_math_female = (
    (df['gender'] == 'female') &
    (df['test preparation course'] != 'complete')
&
    (df['math score'] <= passmark)
).mean()
print (f'{falied_math_female:.2%}')

9.70%

### Задание 11

С помощью `groupby` выполните задания ниже. Также выведите время выполнения каждого из заданий.
* Для каждой этнической группы выведите средний балл за экзамен по чтению
* Для каждого уровня образования выведите минимальный балл за экзамен по письму

In [193]:
# ваш код здесь
start_time = time.time()
writing_score_mean = df.groupby('race/ethnicity')['writing score'].mean()

end_time = time.time()
print(f"\nВремя выполнения: {end_time - start_time:.4f} секунд\n")
writing_score_ethnicity

Время выполнения: 0.0015 секунд

race/ethnicity
group A    62.674157
group B    65.600000
group C    67.827586
group D    70.145038
group E    71.407143
Name: writing score, dtype: float64

In [191]:

start_time = time.time()

reading_score_min = (df.groupby('parental level of education')['reading score']
                        .min()
                        .sort_values(ascending = False))

end_time = time.time()
print(f"\nВремя выполнения: {end_time - start_time:.4f} секунд\n")
reading_score_min

Время выполнения: 0.0016 секунд

parental level of education
master's degree       42
bachelor's degree     41
associate's degree    31
high school           24
some college          23
some high school      17
Name: reading score, dtype: int64

### Задание 12

Выполните задание 11 с помощью циклов. Сравните время выполнения

In [189]:
# ваш код здесь
import pandas as pd
import time

# 1. Средний балл по чтению для каждой этнической группы
start_time = time.time()

ethnic_groups = df['race/ethnicity'].unique()
reading_avg_by_ethnicity = {}

for group in ethnic_groups:
    avg_score = df[df['race/ethnicity'] == group]['reading score'].mean()
    reading_avg_by_ethnicity[group] = avg_score
    print(f"Этническая группа {group}: средний балл по чтению = {avg_score:.2f}")

end_time = time.time()
print(f"\nВремя выполнения: {end_time - start_time:.4f} секунд\n")

# 2. Минимальный балл по письму для каждого уровня образования
start_time = time.time()

education_levels = df['parental level of education'].unique()
writing_min_by_education = {}

for level in education_levels:
    min_score = df[df['parental level of education'] == level]['writing score'].min()
    writing_min_by_education[level] = min_score
    print(f"Уровень образования {level}: минимальный балл по письму = {min_score}")

end_time = time.time()
print(f"\nВремя выполнения: {end_time - start_time:.4f} секунд")

Этническая группа group B: средний балл по чтению = 67.35
Этническая группа group C: средний балл по чтению = 69.10
Этническая группа group A: средний балл по чтению = 64.67
Этническая группа group D: средний балл по чтению = 70.03
Этническая группа group E: средний балл по чтению = 73.03

Время выполнения: 0.0057 секунд

Уровень образования bachelor's degree: минимальный балл по письму = 38
Уровень образования some college: минимальный балл по письму = 19
Уровень образования master's degree: минимальный балл по письму = 46
Уровень образования associate's degree: минимальный балл по письму = 35
Уровень образования high school: минимальный балл по письму = 15
Уровень образования some high school: минимальный балл по письму = 10

Время выполнения: 0.0043 секунд

### Задание 13

Выведите на экран средние баллы студентов по каждому предмету в зависимости от пола и уровня образования.  
То есть должно получиться количество групп, равных 2 * (число уровней образования), и для каждой такой группы выведите средний балл по каждому из предметов.

Это можно сделать с помощью сводных таблиц ([pivot_table](https://www.kaggle.com/kamilpolak/tutorial-how-to-use-pivot-table-in-pandas))

In [112]:
import numpy as np

In [120]:
# ваш код здесь

grouped = pd.pivot_table(
    df,
    index=['gender','parental level of education'],
    values =['math score', 'reading score', 'writing score'],
    aggfunc='mean')

grouped

                                    math score  reading score  writing score
gender parental level of education
female associate's degree            65.250000      74.120690      74.000000
       bachelor's degree             68.349206      77.285714      78.380952
       high school                   59.351064      68.202128      66.691489
       master's degree               66.500000      76.805556      77.638889
       some college                  65.406780      73.550847      74.050847
       some high school              59.296703      69.109890      68.285714
male   associate's degree            70.764151      67.433962      65.405660
       bachelor's degree             70.581818      68.090909      67.654545
       high school                   64.705882      61.480392      58.539216
       master's degree               74.826087      73.130435      72.608696
       some college                  69.009259      64.990741      63.148148
       some high school              67.840909      64.693182      61.375000

### Задание 14

Сколько студентов успешно сдали экзамен по математике?

Создайте новый столбец в таблице `df` под названием `Math_PassStatus` и запишите в него F, если студент не сдал экзамен по математике (балл за экзамен < passmark), и P иначе.

Посчитайте количество студентов, сдавших и не сдавших экзамен по математике.

Сделайте аналогичные шаги для экзаменов по чтению и письму.

In [175]:
# ваш код здесь
import numpy as np
passmark = 50
df['Math_PassStatus'] = np.where(df['math score'] >= 50, 'P', 'F')
df['Writing_PassStatus'] = np.where(df['writing score'] >= 50, 'P', 'F')
df['Reading_PassStatus'] = np.where(df['reading score'] >= 50, 'P', 'F')
# df

math_pssed = (df['Math_PassStatus'] == 'P').sum()
writing_passed = (df['Writing_PassStatus'] == 'P').sum()
reading_passed = (df['Reading_PassStatus'] == 'P').sum()


print(f"Math passed: {math_passed}")
print(f"Writing passed: {writing_passed}")
print(f"Reading passed: {reading_passed}")

Math passed: 0.85
Writing passed: 886
Reading passed: 910

### Задание 15

Сколько студентов успешно сдали все экзамены?

Создайте столбец `OverAll_PassStatus` и запишите в него для каждого студента 'F', если студент не сдал хотя бы один из трех экзаменов, а иначе 'P'.

Посчитайте количество студентов, которые сдали все экзамены.

In [187]:
# ваш код здесь
df['OverAll_PassStatus'] = np.where(
   (df['math score'] >= 50) &
    (df['reading score'] >= 50) &
    (df['writing score'] >= 50), 
    'P', 
    'F')
Over_all_passed = (df['OverAll_PassStatus'] == 'P').sum()
Over_all_passed

812

### Задание 16

Переведем баллы в оценки

**Система перевода баллов в оценки**
*   [90;100] = A
*   [80;90) = B
*   [70;80) = C
*   [60;70) = D
*   [50;60) = E
*   [0;50) = F (Fail)

Создайте вспомогательную функцию, которая будет по среднему баллу за три экзамена выставлять оценку студенту по данным выше критериям.

Создайте столбец `Grade` и запишите в него оценку каждого студента.

Выведите количество студентов, получивших каждую из оценок.

In [195]:
import pandas as pd
import numpy as np

def GetGrade(average_mark):
    if average_mark >= 90:
        return 'A'
    elif average_mark >= 80:
        return 'B'
    elif average_mark >= 70:
        return 'C'
    elif average_mark >= 60:
        return 'D'
    elif average_mark >= 50:
        return 'E'
    else:
        return 'F'

# Создаем столбец со средним баллом по трем экзаменам
df['Average_Score'] = df[['math score', 'reading score', 'writing score']].mean(axis=1)

# Применяем функцию GetGrade для создания столбца с оценками
df['Grade'] = df['Average_Score'].apply(GetGrade)

# Выводим количество студентов по каждой оценке
grade_counts = df['Grade'].value_counts().sort_index()
print("Количество студентов по оценкам:")
print(grade_counts)

Количество студентов по оценкам:
Grade
A     52
B    146
C    261
D    256
E    182
F    103
Name: count, dtype: int64